---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ReferenceLineSubcategory
source: html/e834b4fc-6e52-497e-6d23-d5b3baeb6409.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ReferenceLineSubcategory Property

"Subcategory"

## Syntax (C#)
```csharp
public static ForgeTypeId ReferenceLineSubcategory { get; }
```